orgmode/office.org
#+title: Office
#+author: KRV Perera
#+email: rukshan.viduranga@gmail.com

=ox-twbs=

* TOP
:PROPERTIES:
:CUSTOM_ID: TOP
:END:
[[file:krvperera.org][HOME]] [[file:linux.org][LINUX]] [[file:EldenRing.org][Elden Ring]] [[file:country.org][Country]] [[file:org-mode-reference-in.org][HotKeys]] [[file:Professional.org][Professional]] [[#BOTTOM][BOTTOM]]

* Special links

[[https://ballerina.io/spec/lang/master/][Live Spec]] [[https://www.mmtk.io/code][MMTK]]

[[https://pnwamk.github.io/sst-tutorial/][Down and Dirty with Semantic Set-theoretic Types (a tutorial) v0.4]]



* Office tasks

** TODO closure annotations - fields
DEADLINE: <2022-05-08 ඉ>
:LOGBOOK:
CLOCK: [2022-05-08 ඉ 11:30]
:END:
#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2022-05-08 ඉ 11:31]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:00* |
#+END:


Refactoring is done. Some changes done to process arrow expression is breaking the build. Target is to first fix the annotation fields.
Current problem is with the function related to the field is not added in a context or in a body.

Annotations are fixed successfully may have to change the key now need to test on native side

*** DEBUG
    classDef    : class $annonType$_1 { string xField = hosty; }
    function    : annot_func$_0 is function (LAMDA)
    mapLiteral  : {HSCsa: {hostRecField: hosty}.cloneReadOnly()}

**** Fields
***** attachments
HSCfa       : expr ( {hostRecField: hosty} )

function    : [LAMBDA] $annot_func$_1([]) (map) Body: {}
mapLiteral  : "{HSCfa: {hostRecField: hosty}.cloneReadOnly()}"

mapLiteral  :
    HSCsa: {hostRecField: hosty}.cloneReadOnly()
    $field$.xField: $annot_func$_1()


*** TODO ArrowExpr debugging

**** main
    blockMap = $map$block$oce$_1
    classMap = $map$objectCtor_block

**** update object init method
#+BEGIN_SRC
    self.$map$objectCtor_block = $map$block$oce$_1
#+END_SRC


**** MyFunc body update debugging
    1 - Closure desugar from top level nodes
        because the receiver is a closure symbol[[https://pnwamk.github.io/sst-tutorial/][Down and Dirty with Semantic Set-theoretic Types]]

        ClosureDesugar:523,



** TODO closure start actions
DEADLINE: <2022-05-08 Sun   >

** TODO Closures for object ctor new approach
pass closure variables to object directly for fields


** code reviews
*** [[https://github.com/rdulmina][rdulmina]]

**** DONE [[https://github.com/ballerina-platform/ballerina-lang/pull/36044][Fix NPE when variable of undefined type used in from and join clauses]]
CLOSED: [2022-05-18 බ 14:13]

**** TODO Parser changes for resource method call action : [[https://github.com/ballerina-platform/ballerina-lang/pull/36378][PR]]

**** TODO spec conformance test


*** [[https://github.com/lasinicl][lasinicl]]
**** Support running strands safetly on a separate thread [[https://github.com/ballerina-platform/ballerina-lang/pull/36395][PR]]

*** [[https://github.com/gimantha][gimantha]]

**** DONE COMMENT PR I need to review
CLOSED: [2022-05-18 බ 14:13]

[[https://github.com/ballerina-platform/ballerina-lang/pull/35960][PR Lin]]
added a comment checking the situation with `var`

Gimantha : No contextually expected type is missing


*** [[https://github.com/lochana-chathura][lochana-chathura]]

**** DONE isSameType [[https://github.com/ballerina-platform/ballerina-lang/pull/35925][pr]]
CLOSED: [2022-05-18 බ 14:12]

Created a new issue [[https://github.com/ballerina-platform/ballerina-lang/issues/36069][36069]]

**** DONE Fix issue cloning BLangLiteral [[https://github.com/ballerina-platform/ballerina-lang/pull/36177][PR]]

CLOSED: [2022-05-18 බ 14:12]



**** DONE Fix issuw in block-stmt parsing context back [[https://github.com/ballerina-platform/ballerina-lang/pull/36297][PR]]
CLOSED: [2022-05-27 Fri 17:16]

**** TODO Allot inference for spread operator with variable length arrays [[https://github.com/ballerina-platform/ballerina-lang/pull/36248][PR]]
CLOSED: [2022-06-13 Mon 02:05]

**** TODO isSameType check blindly returns true for pairs found in `unresolvedTypes` set : [[https://github.com/ballerina-platform/ballerina-lang/issues/36069][PR]]

*** [[https://github.com/suleka96][suleka96]]

**** TODO Fix several integer related issues : [[https://github.com/ballerina-platform/ballerina-lang/pull/34622][PR]]
DEADLINE: <2022-05-21 සෙ>


*** [[https://github.com/KavinduZoysa][KavinduZoysa]]

**** TODO Create identifiers for anon types : [[https://github.com/ballerina-platform/ballerina-lang/pull/36168][PR]]
DEADLINE: <2022-05-18 බ>
    added few comments about API and usage
    Need to review string builder usage and string object creations in loops

**** DONE Add tests to test visibility of non-public symbols : [[https://github.com/ballerina-platform/ballerina-lang/pull/36188][PR]]
CLOSED: [2022-05-27 Fri 17:18] DEADLINE: <2022-05-19 බ්‍ර>

**** TODO Disallow named-args that specify field of included-record which is an arg : [[https://github.com/ballerina-platform/ballerina-lang/pull/35800][PR]]
    Small comment on the data structure usage. Logic should already reviwed by others
    Fixed the issue I mentioned

*** [[https://github.com/SandaruJayawardana][SandaruJayawardana]]
**** Add desugaring changes for creating maps with query expression : [[https://github.com/ballerina-platform/ballerina-lang/pull/36366][PR]]
**** Add type checking changes for creating maps with query expressions : [[https://github.com/ballerina-platform/ballerina-lang/pull/36352][PR]]
**** Fix relational operator related issues : [[https://github.com/ballerina-platform/ballerina-lang/pull/36191][PR]]

* BOTTOM
:PROPERTIES:
:CUSTOM_ID: BOTTOM
:END:
[[#TOP][TOP]]
