orgmode/office.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <!-- 2022-06-22 Wed 15:36 -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii" />
  <meta name="viewport" content=
  "width=device-width, initial-scale=1" />

  <title>Office</title>
  <meta name="author" content="KRV Perera" />
  <meta name="generator" content="Org Mode" />
</head>

<body>
  <div id="content" class="content">
    <h1 class="title">Office</h1>

    <div id="table-of-contents" role="doc-toc">
      <h2>Table of Contents</h2>

      <div id="text-table-of-contents" role="doc-toc">
        <ul>
          <li><a href="#TOP">1. TOP</a></li>

          <li><a href="#org28754c3">2. Special links</a></li>

          <li>
            <a href="#org6e0dae7">3. Office tasks</a>

            <ul>
              <li>
                <a href="#org07f40fb">3.1. <span class=
                "todo TODO">TODO</span> closure annotations -
                fields</a>

                <ul>
                  <li><a href="#org33da817">3.1.1. DEBUG</a></li>

                  <li><a href="#org9956c91">3.1.2. <span class=
                  "todo TODO">TODO</span> ArrowExpr
                  debugging</a></li>
                </ul>
              </li>

              <li><a href="#org65f7f94">3.2. <span class=
              "todo TODO">TODO</span> closure start
              actions</a></li>

              <li><a href="#orgbfb0a90">3.3. <span class=
              "todo TODO">TODO</span> Closures for object ctor new
              approach</a></li>

              <li>
                <a href="#orgb939159">3.4. code reviews</a>

                <ul>
                  <li><a href="#orga53d3b9">3.4.1.
                  rdulmina</a></li>

                  <li><a href="#org8a0e8bc">3.4.2.
                  lasinicl</a></li>

                  <li><a href="#org7e98fd3">3.4.3.
                  gimantha</a></li>

                  <li><a href="#org4d1979e">3.4.4.
                  lochana-chathura</a></li>

                  <li><a href="#org6803d9f">3.4.5.
                  suleka96</a></li>

                  <li><a href="#org68bb899">3.4.6.
                  KavinduZoysa</a></li>

                  <li><a href="#orgbf395fc">3.4.7.
                  SandaruJayawardana</a></li>
                </ul>
              </li>
            </ul>
          </li>

          <li><a href="#BOTTOM">4. BOTTOM</a></li>
        </ul>
      </div>
    </div>

    <p><code>ox-twbs</code></p>

    <div id="outline-container-TOP" class="outline-2">
      <h2 id="TOP"><span class="section-number-2">1.</span>
      TOP</h2>

      <div class="outline-text-2" id="text-TOP">
        <p><a href="krvperera.html">HOME</a> <a href=
        "linux.html">LINUX</a> <a href="EldenRing.html">Elden
        Ring</a> <a href="country.html">Country</a> <a href=
        "org-mode-reference-in.html">HotKeys</a> <a href=
        "Professional.html">Professional</a> <a href=
        "#BOTTOM">BOTTOM</a></p>
      </div>
    </div>

    <div id="outline-container-org28754c3" class="outline-2">
      <h2 id="org28754c3"><span class="section-number-2">2.</span>
      Special links</h2>

      <div class="outline-text-2" id="text-2">
        <p><a href="https://ballerina.io/spec/lang/master/">Live
        Spec</a> <a href="https://www.mmtk.io/code">MMTK</a></p>

        <p><a href="https://pnwamk.github.io/sst-tutorial/">Down
        and Dirty with Semantic Set-theoretic Types (a tutorial)
        v0.4</a></p>
      </div>
    </div>

    <div id="outline-container-org6e0dae7" class="outline-2">
      <h2 id="org6e0dae7"><span class="section-number-2">3.</span>
      Office tasks</h2>

      <div class="outline-text-2" id="text-3"></div>

      <div id="outline-container-org07f40fb" class="outline-3">
        <h3 id="org07f40fb"><span class=
        "section-number-3">3.1.</span> <span class=
        "todo TODO">TODO</span> closure annotations - fields</h3>

        <div class="outline-text-3" id="text-3-1">
          <table border="2" cellspacing="0" cellpadding="6" rules=
          "groups" frame="hsides">
            <caption class="t-above">
              <span class="table-number">Table 1:</span> Clock
              summary at <span class=
              "timestamp-wrapper"><span class=
              "timestamp">[2022-05-08 Sun 11:31]</span></span>
            </caption>

            <colgroup>
              <col class="org-left" />
              <col class="org-left" />
            </colgroup>

            <thead>
              <tr>
                <th scope="col" class="org-left">Headline</th>

                <th scope="col" class="org-left">Time</th>
              </tr>
            </thead>

            <tbody>
              <tr>
                <td class="org-left"><b>Total time</b></td>

                <td class="org-left"><b>0:00</b></td>
              </tr>
            </tbody>
          </table>

          <p>Refactoring is done. Some changes done to process
          arrow expression is breaking the build. Target is to
          first fix the annotation fields. Current problem is with
          the function related to the field is not added in a
          context or in a body.</p>

          <p>Annotations are fixed successfully may have to change
          the key now need to test on native side</p>
        </div>

        <div id="outline-container-org33da817" class="outline-4">
          <h4 id="org33da817"><span class=
          "section-number-4">3.1.1.</span> DEBUG</h4>

          <div class="outline-text-4" id="text-3-1-1">
            <p>classDef : class $annonType$<sub>1</sub> { string
            xField = hosty; } function :
            annot<sub>func</sub>$<sub>0</sub> is function (LAMDA)
            mapLiteral : {HSCsa: {hostRecField:
            hosty}.cloneReadOnly()}</p>
          </div>

          <ol class="org-ol">
            <li>
              <a id="org58d3b0e" name="org58d3b0e"></a>Fields<br />

              <ol class="org-ol">
                <li>
                  <a id="orgd0ed574" name=
                  "orgd0ed574"></a>attachments<br />

                  <div class="outline-text-6" id="text-3-1-1-1-1">
                    <p>HSCfa : expr ( {hostRecField: hosty} )</p>

                    <p>function : [LAMBDA]
                    $annot<sub>func</sub>$<sub>1</sub>([]) (map)
                    Body: {} mapLiteral : &ldquo;{HSCfa:
                    {hostRecField:
                    hosty}.cloneReadOnly()}&rdquo;</p>

                    <p>mapLiteral : HSCsa: {hostRecField:
                    hosty}.cloneReadOnly() \(field\).xField:
                    $annot<sub>func</sub>$<sub>1</sub>()</p>
                  </div>
                </li>
              </ol>
            </li>
          </ol>
        </div>

        <div id="outline-container-org9956c91" class="outline-4">
          <h4 id="org9956c91"><span class=
          "section-number-4">3.1.2.</span> <span class=
          "todo TODO">TODO</span> ArrowExpr debugging</h4>

          <div class="outline-text-4" id="text-3-1-2"></div>

          <ol class="org-ol">
            <li>
              <a id="org9af839a" name="org9af839a"></a>main<br />

              <div class="outline-text-5" id="text-3-1-2-1">
                <p>blockMap = $map$block$oce$<sub>1</sub> classMap
                = $map$objectCtor<sub>block</sub></p>
              </div>
            </li>

            <li>
              <a id="org2563013" name="org2563013"></a>update
              object init method<br />

              <div class="outline-text-5" id="text-3-1-2-2">
                <pre class="example">
    self.$map$objectCtor_block = $map$block$oce$_1
</pre>
              </div>
            </li>

            <li>
              <a id="org0947b7d" name="org0947b7d"></a>MyFunc body
              update debugging<br />

              <div class="outline-text-5" id="text-3-1-2-3">
                <p>1 - Closure desugar from top level nodes because
                the receiver is a closure symbol<a href=
                "https://pnwamk.github.io/sst-tutorial/">Down and
                Dirty with Semantic Set-theoretic Types</a></p>

                <p>ClosureDesugar:523,</p>
              </div>
            </li>
          </ol>
        </div>
      </div>

      <div id="outline-container-org65f7f94" class="outline-3">
        <h3 id="org65f7f94"><span class=
        "section-number-3">3.2.</span> <span class=
        "todo TODO">TODO</span> closure start actions</h3>

        <div class="outline-text-3" id="text-3-2"></div>
      </div>

      <div id="outline-container-orgbfb0a90" class="outline-3">
        <h3 id="orgbfb0a90"><span class=
        "section-number-3">3.3.</span> <span class=
        "todo TODO">TODO</span> Closures for object ctor new
        approach</h3>

        <div class="outline-text-3" id="text-3-3">
          <p>pass closure variables to object directly for
          fields</p>
        </div>
      </div>

      <div id="outline-container-orgb939159" class="outline-3">
        <h3 id="orgb939159"><span class=
        "section-number-3">3.4.</span> code reviews</h3>

        <div class="outline-text-3" id="text-3-4"></div>

        <div id="outline-container-orga53d3b9" class="outline-4">
          <h4 id="orga53d3b9"><span class=
          "section-number-4">3.4.1.</span> <a href=
          "https://github.com/rdulmina">rdulmina</a></h4>

          <div class="outline-text-4" id="text-3-4-1"></div>

          <ol class="org-ol">
            <li>
              <a id="org7a94931" name="org7a94931"></a><span class=
              "done DONE">DONE</span> <a href=
              "https://github.com/ballerina-platform/ballerina-lang/pull/36044">
              Fix NPE when variable of undefined type used in from
              and join clauses</a><br />

              <div class="outline-text-5" id="text-3-4-1-1"></div>
            </li>

            <li><a id="org560b620" name=
            "org560b620"></a><span class="todo TODO">TODO</span>
            Parser changes for resource method call action :
            <a href=
            "https://github.com/ballerina-platform/ballerina-lang/pull/36378">
            PR</a><br /></li>

            <li><a id="orge556a7c" name=
            "orge556a7c"></a><span class="todo TODO">TODO</span>
            spec conformance test<br /></li>
          </ol>
        </div>

        <div id="outline-container-org8a0e8bc" class="outline-4">
          <h4 id="org8a0e8bc"><span class=
          "section-number-4">3.4.2.</span> <a href=
          "https://github.com/lasinicl">lasinicl</a></h4>

          <div class="outline-text-4" id="text-3-4-2"></div>

          <ol class="org-ol">
            <li><a id="org48257eb" name="org48257eb"></a>Support
            running strands safetly on a separate thread <a href=
            "https://github.com/ballerina-platform/ballerina-lang/pull/36395">
            PR</a><br /></li>
          </ol>
        </div>

        <div id="outline-container-org7e98fd3" class="outline-4">
          <h4 id="org7e98fd3"><span class=
          "section-number-4">3.4.3.</span> <a href=
          "https://github.com/gimantha">gimantha</a></h4>
        </div>

        <div id="outline-container-org4d1979e" class="outline-4">
          <h4 id="org4d1979e"><span class=
          "section-number-4">3.4.4.</span> <a href=
          "https://github.com/lochana-chathura">lochana-chathura</a></h4>

          <div class="outline-text-4" id="text-3-4-4"></div>

          <ol class="org-ol">
            <li>
              <a id="orga247e9c" name="orga247e9c"></a><span class=
              "done DONE">DONE</span> isSameType <a href=
              "https://github.com/ballerina-platform/ballerina-lang/pull/35925">
              pr</a><br />

              <div class="outline-text-5" id="text-3-4-4-1">
                <p>Created a new issue <a href=
                "https://github.com/ballerina-platform/ballerina-lang/issues/36069">
                36069</a></p>
              </div>
            </li>

            <li>
              <a id="orgfda558c" name="orgfda558c"></a><span class=
              "done DONE">DONE</span> Fix issue cloning
              BLangLiteral <a href=
              "https://github.com/ballerina-platform/ballerina-lang/pull/36177">
              PR</a><br />

              <div class="outline-text-5" id="text-3-4-4-2">
                <p>CLOSED: <span class=
                "timestamp-wrapper"><span class=
                "timestamp">[2022-05-18 Wed
                14:12]</span></span></p>
              </div>
            </li>

            <li>
              <a id="org598c04b" name="org598c04b"></a><span class=
              "done DONE">DONE</span> Fix issuw in block-stmt
              parsing context back <a href=
              "https://github.com/ballerina-platform/ballerina-lang/pull/36297">
              PR</a><br />

              <div class="outline-text-5" id="text-3-4-4-3"></div>
            </li>

            <li>
              <a id="org1f6e59e" name="org1f6e59e"></a><span class=
              "todo TODO">TODO</span> Allot inference for spread
              operator with variable length arrays <a href=
              "https://github.com/ballerina-platform/ballerina-lang/pull/36248">
              PR</a><br />

              <div class="outline-text-5" id="text-3-4-4-4"></div>
            </li>

            <li><a id="orgc3a9056" name=
            "orgc3a9056"></a><span class="todo TODO">TODO</span>
            isSameType check blindly returns true for pairs found
            in `unresolvedTypes` set : <a href=
            "https://github.com/ballerina-platform/ballerina-lang/issues/36069">
            PR</a><br /></li>
          </ol>
        </div>

        <div id="outline-container-org6803d9f" class="outline-4">
          <h4 id="org6803d9f"><span class=
          "section-number-4">3.4.5.</span> <a href=
          "https://github.com/suleka96">suleka96</a></h4>

          <div class="outline-text-4" id="text-3-4-5"></div>

          <ol class="org-ol">
            <li>
              <a id="org87599d6" name="org87599d6"></a><span class=
              "todo TODO">TODO</span> Fix several integer related
              issues : <a href=
              "https://github.com/ballerina-platform/ballerina-lang/pull/34622">
              PR</a><br />

              <div class="outline-text-5" id="text-3-4-5-1"></div>
            </li>
          </ol>
        </div>

        <div id="outline-container-org68bb899" class="outline-4">
          <h4 id="org68bb899"><span class=
          "section-number-4">3.4.6.</span> <a href=
          "https://github.com/KavinduZoysa">KavinduZoysa</a></h4>

          <div class="outline-text-4" id="text-3-4-6"></div>

          <ol class="org-ol">
            <li>
              <a id="org8412150" name="org8412150"></a><span class=
              "todo TODO">TODO</span> Create identifiers for anon
              types : <a href=
              "https://github.com/ballerina-platform/ballerina-lang/pull/36168">
              PR</a><br />

              <div class="outline-text-5" id="text-3-4-6-1">
                <p>added few comments about API and usage Need to
                review string builder usage and string object
                creations in loops</p>
              </div>
            </li>

            <li>
              <a id="orgf87958d" name="orgf87958d"></a><span class=
              "done DONE">DONE</span> Add tests to test visibility
              of non-public symbols : <a href=
              "https://github.com/ballerina-platform/ballerina-lang/pull/36188">
              PR</a><br />

              <div class="outline-text-5" id="text-3-4-6-2"></div>
            </li>

            <li>
              <a id="org71f53b7" name="org71f53b7"></a><span class=
              "todo TODO">TODO</span> Disallow named-args that
              specify field of included-record which is an arg :
              <a href=
              "https://github.com/ballerina-platform/ballerina-lang/pull/35800">
              PR</a><br />

              <div class="outline-text-5" id="text-3-4-6-3">
                <p>Small comment on the data structure usage. Logic
                should already reviwed by others Fixed the issue I
                mentioned</p>
              </div>
            </li>
          </ol>
        </div>

        <div id="outline-container-orgbf395fc" class="outline-4">
          <h4 id="orgbf395fc"><span class=
          "section-number-4">3.4.7.</span> <a href=
          "https://github.com/SandaruJayawardana">SandaruJayawardana</a></h4>

          <div class="outline-text-4" id="text-3-4-7"></div>

          <ol class="org-ol">
            <li><a id="orgc9bea6d" name="orgc9bea6d"></a>Add
            desugaring changes for creating maps with query
            expression : <a href=
            "https://github.com/ballerina-platform/ballerina-lang/pull/36366">
            PR</a><br /></li>

            <li><a id="org6863d3e" name="org6863d3e"></a>Add type
            checking changes for creating maps with query
            expressions : <a href=
            "https://github.com/ballerina-platform/ballerina-lang/pull/36352">
            PR</a><br /></li>

            <li><a id="org131b67d" name="org131b67d"></a>Fix
            relational operator related issues : <a href=
            "https://github.com/ballerina-platform/ballerina-lang/pull/36191">
            PR</a><br /></li>
          </ol>
        </div>
      </div>
    </div>

    <div id="outline-container-BOTTOM" class="outline-2">
      <h2 id="BOTTOM"><span class="section-number-2">4.</span>
      BOTTOM</h2>

      <div class="outline-text-2" id="text-BOTTOM">
        <p><a href="#TOP">TOP</a></p>
      </div>
    </div>
  </div>

  <div id="postamble" class="status">
    <p class="author">Author: KRV Perera</p>

    <p class="date">Created: 2022-06-22 Wed 15:36</p>
  </div>
</body>
</html>
